/**
 * 操作符
 * ECMAScript-262 描述了一组可用于操作数据值的操作符，包括数学操作符（加、减）、位操作符、关系操作符和相等操作符。
 * ECMAScript 中操作符是特殊的，因为它们可用于各种值，包括字符串，数值，布尔值，甚至还有对象。
 *      在应用给对象时，操作符通常会调用 valueOf() 和/或 toString() 方法来取得可计算的值
 */
/**
 * 一元操作符：只操作一个值的操作符就是一元操作符（unary operator）。
 *  递增/递减操作符 ++/--
 *  一元加减操作符 +/-
 */
/**
 * 位操作符
 *  按位非 ～ ：1 变 0，0 变 1
 *  按位与 & ： 两者为 1 时 为 1，否则为 0
 *  按位或 ｜ ：两位任意一位有 1 时为 1，否则为 0
 *  按位异或 ^ ：两位不相等为 1，否则为 0  
 *  左移 << ：按照指定位数向左移动指定位数
 *  有符号右移 >> : 按照指定位数向右移动指定位数
 *  无符号右移 >>> : 按照指定位数向右移动指定位数，空位补0
 */
/**
 * 布尔操作符
 *  逻辑非 !
 *  逻辑与 &&
 *  逻辑或 ||
 */
/**
 * 乘性操作符
 *  乘法操作符 *
 *  除法操作符 /
 *  取模 %
 */
/**
 * 关系操作符
 *  小于 <
 *  大于 >
 *  小于等于 <=
 *  大于等于 >=
 */
/**
 * 相等操作符
 *  相等操作符 ==
 *  全等操作符 ===
 *  不等于操作符 !=
 *  不全等操作符 !==
 */
/**
 * 条件操作符（三元操作符）
 * variable = boolean_expression ? true_value : false_value;
 */
/**
 * 赋值操作符
 *  乘后赋值 (*=)
 *  除后赋值 (/=)
 *  取模后赋值 (%=)
 *  加厚赋值 (+=)
 *  减后赋值 (-=)
 *  左移后赋值 (<<=)
 *  右移后赋值 (>>=)
 *  无符号右移 (>>>=)
 */
/**
 * 逗号操作符
 * let num1 = 1, num2 = 2, num3 = 3;
 */